In [18]:
# Write the code to implement linspace and logspace functions.

import numpy as np

In [19]:
np.linspace(0,1,5)

array([0.  , 0.25, 0.5 , 0.75, 1.  ])

In [20]:
np.logspace(0,3,4)

array([   1.,   10.,  100., 1000.])

In [21]:
# Create a data frame with some items and and keep one condition to check age is less then 20.

import pandas as pd
cols = ["name","age","gender","job"]
cols

user1 = pd.DataFrame([["soham0",22,"m","student"],["soham1",26,"m","student"],["soham2",19,"m","student"],["soham3",18,"m","student"]],columns =cols)
user1

     name  age gender      job
0  soham0   22      m  student
1  soham1   26      m  student
2  soham2   19      m  student
3  soham3   18      m  student

In [22]:
user1[user1.age < 20]

     name  age gender      job
2  soham2   19      m  student
3  soham3   18      m  student